<template>
    <div class="conditions">
        <b-row class="conditions__row">
            <b-col v-for="item in conditions" :key="item.title"
             lg="12" class="conditions__column">
                <h6 class="conditions__title">{{item.title}}</h6>
                <p class="conditions__text">{{item.content}}</p>
            </b-col>
        </b-row>
    </div>
</template>

<script>
export default {
    data(){
        return {
            conditions: [
                {
                    title: 'Условия сервиса',
                    content: 'Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?'
                },
                {
                    title: 'Условия доставки',
                    content: 'Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?'
                },
                {
                    title: 'Условия возврата',
                    content: 'Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?'
                }
            ]
        }
    }
}
</script>

<style lang="scss">
    .conditions {
        margin-bottom: 100px;
        margin-top: 55px;
        &__column {
            background: #fff;
            border-radius: 30px;
            padding: 25px 30px;
            &:not(:last-child) {
                margin-bottom: 50px;
            }
        }
        &__title {
            font-size: 17px;
            font-weight: 600;
            color: #1C1C27;
            margin-bottom: 15px;
        }
        &__text {
            font-size: 17px;
            font-weight: 400;
            padding-left: 15px;
            line-height: 20px;
            margin-bottom: 0;
        }
    }
</style>